[
  {
    "name": "Dante Moore",
    "team": "New York Jets",
    "position": "QB",
    "college": "Oregon",
    "body": "It's become clear that Justin Fields is not the long term answer for the Jets, and unless Aaron Glenn and management think they can find the answer to their problems in a veteran quarterback, it's looking fairly certain that QB will be the play for them with their first selection in the upcoming draft. Out of the players available, I think Moore is the best option for the Jets. He's a true athlete at the football position that checks all the boxes of what teams are looking for at quarterback in 2025, with an elite arm, good mobility, and notable composure in the pocket for a player who is just in his second season of starting at the college level. Moore looks like a truly different level of player than he did at UCLA two seasons ago, which is going to give teams confidence in his ability to continue to grow at the NFL level. The Jets have two desperate needs at the QB position. First, someone that can distribute the ball effectively to their receivers. Second, someone that can serve as a true leader for the future of the team. Moore would immediately lock down both of these needs and be a true game changer for the organization to finally rise to a true threat in the AFC."
  },
  {
    "name": "Reuben Bain Jr.",
    "team": "Miami Dolphins",
    "position": "EDGE",
    "college": "Miami",
    "body": "The Dolphins season started badly and it hasn't exactly gotten better, and it's going to lead to a fire sale for the 'phins at the trade deadline. Aside from Kenneth Grant, who I think is going to become a very good player despite some early growing pains, there's little that's solidified on the Miami defensive line moving forward. It seems as if Jaelen Phillips and Bradley Chubb are as good as gone, and even with them it's been nothing short of a mess on the defensive front. I know Dolphins fans are going to want a quarterback here, but with Bain still on the board it's frankly not much of a consideration. Edge rusher is the second most important position in football, and it's not often you get a chance to draft one that is going to make as clear an impact as Reuben Bain Jr. He's a clear game-changing talent with three down impact, a kind of player that is nearly impossible to find and more impossible for opposing teams to lock down."
  },
  {
    "name": "Fernando Mendoza",
    "team": "New Orleans Saints",
    "position": "QB",
    "college": "Indiana",
    "body": "Moving into his second year as head coach, it seems likely that Kellen Moore will be looking for his quarterback of the future for the Saints. In the midst of a seemingly long and challenging rebuild, it'll be more important for the team to nail this pick than ever to set the stage for future success. There was a good amount of hype following Mendoza out of Cal last year, but he's exceeded all of those expectations so far at Indiana. As of now, he's the leading candidate for the Heisman and has a real argument to go number one in April. Mendoza has a huge arm and his ability to layer throws and rope balls into tight windows pops out on tape. He's a true athlete for his size with the ability to beat defenses with his legs despite being primarily a pocket passer. Put him in an offense with Chris Olave, Alvin Kamara, and an offensive line featuring two first round picks over the past couple drafts at tackle, and I truly think they could be a tough matchup for opposing defenses. "
  },
  {
    "name": "Arvell Reese",
    "team": "Tennessee Titans",
    "position": "EDGE/LB",
    "college": "Ohio State",
    "body": "The Titans are a bit of a mess offensively right now, but if you're picking at four it's about getting the best player on the board, and that's Arvell Reese. Reese has rightfully shot up draft boards recently after scouts have seen what he's done on the field at Ohio State. He's been very good as a coverage linebacker, where his athleticism lets him stick with receivers despite his large frame, but where he's really shined is rushing the passer. So far this year, he has 16 pressures in only 58 pass rush snaps, which ranks him among the best in the country in pass rush win rate. While it may not be as impressive as Travis Hunter playing both sides of the ball, Reese's ability to play both off-ball linebacker and edge rusher at a high level would give an NFL team, in this case the Titans, a truly unique player that you could build a defense around."
  },
  {
    "name": "Makai Lemon",
    "team": "Baltimore Ravens",
    "position": "WR",
    "college": "USC",
    "body": "There's a little bit of an epidemic of teams with fantastic quarterbacks not having the supporting cast around them. Zay Flowers is a good player, but there's a need for a true top wide receiver in Baltimore, and Makai Lemon would give them just that. He's been a cheat code so far this season for the Trojans, and is going to be a top threat in the NFL the day that he steps foot on the field. Even though the slot is where he does the most damage, he's a weapon wherever he's lined up on the field. He epitomizes a lot of what is seen from top receiver options in the NFL today in guys like Justin Jefferson, Amon-Ra St. Brown, and Ladd McConkey with top tier twitch and game feel that changes the game entirely. He's my top receiver, and will be an absolute nightmare for any team that has to defend him."
  },
  {
    "name": "Ty Simpson",
    "team": "Cleveland Browns",
    "position": "QB",
    "college": "Alabama",
    "body": "It wasn't a particularly good day for the Crimson Tide when they played against Florida State in week one. Simpson was under duress almost constantly, the offense struggled to get anything going, and there was talk Kalen Deboer was going to be on the hot seat. Yet, also during that game, there was a rare sense of calm from the first year starting quarterback that really stuck out. Admittedly, it was marred by a couple rough mistakes and a tough loss, but overall I was impressed. Since then, Simpson has been exceptional. He's got phenomenal feel for the pocket, good timing, and the athletic profile to project as a starting quarterback in the NFL. Right now, he's my top quarterback, and unless you're convinced Dillon Gabriel or Shedeur Sanders is the answer in Cleveland, I think the right guy to finally end the revolving door that has been the Browns starting quarterback."
  },
  {
    "name": "Jordyn Tyson",
    "team": "Las Vegas Raiders",
    "position": "WR",
    "college": "Arizona State",
    "body": "Even after taking Ashton Jeanty this year, the Raiders offense looks stagnant. A lot of that is due to Brock Bowers' week one injury, but there's also a lack of talent at the wide receiver position that is especially apparent due to said injury. With it looking likely Jakobi Meyers leaves in free agency, the Raiders receiving group would greatly benefit from a second top tier option, and Tyson would give them just that. Tyson is a sure handed receiver that just seems to have a knack for getting open, as he's likely to eclipse 1,000 yards for the second straight season. There's few players in college that have a feel for the game as strong as Tyson does, and he's another receiver that can be a threat wherever you line him up, whether that's in the slot or on the outside. Tyson projects as a true number one option for whoever drafts him, and the combination of him, Bowers, and Jeanty would be a fearsome trio of offensive weapons for the Raiders next year."
  },
  {
    "name": "Mansoor Delane",
    "team": "New York Giants",
    "position": "CB",
    "college": "LSU",
    "body": "Delane is the first player off the board that pretty much nobody had on their watch list going into the year, but with the way he's popped this season he could go even higher than this. His 2025 season thus far heavily reminds me of Seahawks cornerback Devon Witherspoon, who dominated in his senior year, shot up draft boards, and was drafted fourth overall in 2023. Delane might not go that high, but he's been nigh as dominant as Witherspoon so far this year. For a team in the Giants that is slowly building the pieces of an elite defense with an already excellent defensive line, getting a truly shutdown player in the secondary could put them in the conversations of the better defenses in the NFL. Misses have marred the recent history of the Giants at defensive back in the first round, but Delane has shown a caliber of play this year that would break that trend for the G Men if he falls into their laps."
  },
  {
    "name": "Spencer Fano",
    "team": "Arizona Cardinals",
    "position": "OT",
    "college": "Utah",
    "body": "The Cardinals are a solid team, but lack a true identity. This mentality of good, just not great, is prevalent throughout most of their team. Their defense is good, but lacks a game-defining pass rusher. Kyler is a good quarterback, but he just hasn't pushed his game towards the best in football. Their offensive line is solid, but not quite among the league's best. This move is a push to fix that. To develop an identity as a team that will maul opposing defensive lines with two great tackles: Paris Johnson Jr. on the left and Fano on the right. Fano is ready to immediately play at right tackle for an NFL team after being a starter at Utah for the past three seasons, and would be an instant impact player for the Cardinals. Look at the Lions and the Eagles for a blueprint for how important having two excellent tackles is for a football team. Adding Fano to the line would allow the Cardinals to run the ball with confidence and give more time for the Kyler to MHJ connection to click into high gear."
  },
  {
    "name": "Carnell Tate",
    "team": "Houston Texans",
    "position": "WR",
    "college": "Ohio State",
    "body": "It's absolutely ridiculous that there's a legitimate argument about which Ohio State wide receiver has been the best this year. Jeremiah Smith came into the year as the consensus top player in college football, but Carnell Tate has found another gear this season for the Buckeyes. If I had to bet on a player rising even higher during the latter half of the year, my bet would be on this guy right here, and I already have him going in the top ten. For a Texans team that's been sputtering offensively since Tank Dell went out, Tate would be maybe even better than sliced bread. In addition to Nico Collins and Jayden Higgins, they'd have a legit passing attack alongside a defense that has been one of the most stout and physical in football. There's a real need for a consistent rushing attack as well, but at this point in the draft it's all about getting the best player available, and I had no reservations that Carnell Tate would be that guy for the Texans."
  },
  {
    "name": "Kadyn Proctor",
    "team": "Cincinnati Bengals",
    "position": "OT",
    "college": "Alabama",
    "body": "The Bengals need to find a way to protect Joe Burrow. It's been year after year where the offensive line hasn't done a good enough job of keeping him on his feet, and it only looks worse this year with Burrow out long-term and the team completely failing to run the ball. Proctor would finally be the answer to this problem, or at least a big step forward in fixing it. After a brutal week one against Florida State, Proctor has stepped up his game in a big way and has looked like the true bookend offensive tackle that people thought he would be coming into the year. There's certainly still places in his game that need work, but his combination of size and athleticism is borderline unprecedented at the tackle position. He moves like a tight end despite nose tackle size, and we've even seen the Crimson Tide roll him out as a receiver ala the the Lions with Penei Sewell. With a player like that still available at eleven, I just couldn't justify passing him up."
  },
  {
    "name": "T.J. Parker",
    "team": "Washington Commanders",
    "position": "EDGE",
    "college": "Clemson",
    "body": "There's a good argument about who the second best edge rusher is in this class. There's a few different guys in the conversation, but no one else on the board is as ready to play on all three downs as T.J. Parker. Parker was in conversations to be the first overall pick before the season started, and I think it's fair to say he's just about lived up to that billing. He hasn't quite had the pass rush success that he had last season, but he's still been an impact player for the Clemson defense. All eyes are on him to be a more consistent force during the second half of the year, but for now my bets are on Parker to show the dominance he did during their run to the CFP last year. While the Commanders don't have a desperate need for edge rush help, continuing to add players that can rush the quarterback year after year is imperative to succeed in the modern NFL. This pick is about getting a player that can immediately contribute on all three downs and eventually work his way into the top echelon of edge rushers."
  },
  {
    "name": "Peter Woods",
    "team": "Dallas Cowboys",
    "position": "DT",
    "college": "Clemson",
    "body": "It's only natural that the Clemson guys go back to back, right? Really, though, Peter Woods to the Cowboys is one of those picks that just feels right, even though we're a long ways away from the draft. Woods provides real pass rush juice and athleticism from a guy his size, and has a proven track record of getting to the quarterback at the defensive tackle position. The main concern on his resume is his lack of pressure with an increased workload this season, which may point to him being more of a rotational player than an every down lineman early in his career. With that being said, for a Cowboys team that has tried and failed to improve at defensive tackle in the draft for a long time, Woods would finally give them some homegrown talent at the position. Three down defensive tackles are a real commodity in the NFL, so to be able to get one as refined as Woods here would be a good move to improve the team and an even better move for the future when he starts to emerge as a true pass rush threat."
  },
  {
    "name": "Francis Mauigoa",
    "team": "Minnesota Vikings",
    "position": "OT",
    "college": "Miami",
    "body": "Over the past few years, it's become clear that there's nothing that can help a quarterback more than being comfortable in the pocket. Look at Geno's sudden emergence in Seattle, Baker's resurrection in Tampa Bay, Darnold's continued rise, and Daniel 'Indiana' Jones this year for the Colts, and the common trend is a quarterback confident in the offense around them. The Vikings took J. J. McCarthy for a reason. They think he can be the future of the franchise at the quarterback position, but that doesn't mean he has to do it alone. Alongside a young head coach in Kevin O'Connell that has consistently helped his quarterbacks succeed, the Vikings already have elite talents in Justin Jefferson and Christian Darrisaw, but adding another cornerstone at right tackle would make operating their offense feel like driving a Ferrari down the hills of Italy. That is to say, smooth. Mauigoa is an absolute mauler that would hammer down that right tackle position for years, and with the year he's having at Miami he could go even higher than this come draft day."
  },
  {
    "name": "Jeremiyah Love",
    "team": "Kansas City Chiefs",
    "position": "RB",
    "college": "Notre Dame",
    "body": "There's no way that the Chiefs will be drafting this high come actual draft day, but it's fun to daydream about how good of an addition Love would be to an already great offense. After being the clear RB1 heading into the season, Jeremiyah Love got off to a bit of a slow start, but that's all in the rear mirror after a monster performance against USC where he put up over 250 all-purpose yards. He's a running back with a rare level of refinement for a player at the college level, with both power and agility in his arsenal, great vision, and a proven track-record of both pass blocking and catching the ball out of the backfield. He isn't the kind of all-world athlete that often goes this high in the draft, like Jeanty last year or Gibbs and Bijan in 2023, but his combination of skills makes him a clear day one starter and someone that can instantly enhance an offense. For the Chiefs, he would give them a player that can create yardage rather than just take what is available and one that they would feel confident in playing on all three downs."
  },
  {
    "name": "Caleb Downs",
    "team": "Carolina Panthers",
    "position": "S",
    "college": "Ohio State",
    "body": "It's no secret that the NFL has been a little hesitant to take safeties early recently. The last time a true free safety was taken in the top fifteen was the Dolphins with Minkah Fitzpatrick in 2018, but if there's a player that's worth breaking that streak it's Downs. There's not much that should have to be said about how good Downs is, because he's left it all to see out there on the field. He's put three years of first-round caliber tape on display during his time at Alabama and Ohio State and inevitably feels like a steal here at fifteen. The Panthers already have one of the more underrated defenses in the NFL with both Derrick Brown and Jaycee Horn healthy, but adding Caleb Downs would be a big step forward in cementing themselves as true contenders. Downs is a lockdown safety in coverage on the back end the caliber of which we haven't seen in a long time. He may not be as strong as someone like Brian Branch, but he plays with the same physicality and will to tackle in the run game. There's genuinely not a comparable player to Downs in the NFL right now, and getting him here at fifteen could look like one of the bigger steals in the draft moving into the future."
  },
  {
    "name": "Jermod McCoy",
    "team": "Los Angeles Rams",
    "position": "CB",
    "college": "Tennessee",
    "body": "This is another team player fit that feels extremely strong. McCoy has yet to play this year after suffering a torn ACL in January, but even considering that he's got a good chance to go this high come draft day. After transferring from Oregon State to Tennessee, McCoy was one of the best coverage cornerbacks in college last season in their zone heavy scheme. Often, these zone heavy corners get profiled as mediocre athletes coming out of college, but McCoy couldn't defy this expectation more. He's twitchy, instinctive, and has the top end speed to keep up with even the fastest receivers going down the field, even if that's usually not his assignment. For a Rams defense that plays more zone than almost anyone else in the NFL, McCoy would add a whole different element of juice to their defense. While their corners, especially Darious Williams, have proved to be great in coverage, generally their safeties are the ones with the speed to carry receivers downfield. Getting a player in McCoy that can confidently do so from a boundary corner position, while also being elite in their bread and butter of zone coverage, would be a real game-changer for the Rams defensively."
  },
  {
    "name": "David Bailey",
    "team": "Chicago Bears",
    "position": "EDGE",
    "college": "Texas Tech",
    "body": "If there's anything keeping the Bears from having a genuinely good defense, it's the pass rush. Their team leader in sacks so far this year is Gervon Dexter, and while Montez Sweat is a good player, the rest of their pass rush leaves more to be desired. There's a lot of pass rush threats in this draft, but if you're looking for the one that has a great chance to turn into a true superstar, look no farther than Bailey. He's shown a real knack for getting to the quarterback wherever he goes, from Stanford last year to Texas Tech this year, where he is currently leading the nation in sacks for the Red Raiders. Bailey has shown improvement year over year from the edge, and is on track for a ridiculous eighty-four pressures over a full twelve games. The only reason he's not going top ten is because he's not quite the impact player in the run game that the two edge rushers above him are, but the toolset is all there for him to become an impact run defender. The Bears would be chomping at the bit to get the caliber of pass rusher that Bailey represents, with the belief that he would eventually turn into a three-down star."
  },
  {
    "name": "Austin Siereveld",
    "team": "Cleveland Browns",
    "position": "OT",
    "college": "Ohio State",
    "body": "No player has made more of a jump this year than Siereveld, who came into the year looking like a clear four-year college player that would probably go undrafted. Siereveld filled in at both guard positions last year for the Buckeyes, and did a solid job, but most fans were concerned about him stepping in as the starting left tackle going into 2025. As you can tell by his spot here, those concerns were quickly quieted. After a mediocre game against the Longhorns week one, Siereveld has been a force at the left tackle position both against the run and the pass, being one of the few left tackles yet to give up a sack this season per PFF. Of all the issues with the Browns offense, offensive tackle has been the biggest one so far this year. With Dawand Jones and Jack Conklin injured and struggling even when on the field, it's been fairly ugly. Most scouts have Siereveld moving to guard at the NFL level, but with the way he's showing out at left tackle this year for Ohio State it'd be worth giving him a shot there at the next level."
  },
  {
    "name": "Olaivavega Ioane",
    "team": "Los Angeles Chargers",
    "position": "OG",
    "college": "Penn State",
    "body": "The Chargers have to find a way to protect Justin Herbert. Every single other aspect of Jim Harbaugh's team has the tools to be a Super Bowl contender. The receiver group might be the best in football, Herbert has been dominant when he's given time in the pocket, and Jesse Minter's defense continues to roll. They're so close to greatness, but the offensive line continues to let them down. Getting Rashawn Slater back and healthy will be a big step forward, but the interior continues to look like a problem, and nobody on the team now looks like the answer. For a team in desperate need for players that can protect the quarterback, Ioane is just the player to look for. He's big, physical, and has been dominant in protecting whoever Penn State has had at quarterback this season. Ioane is an experienced starter at left guard that would slot in and immediately add a spot of confidence for the Chargers in their interior. Harbaugh's teams have always relied on their offensive lines, but in order to do that the Bolts are going to have to devote resources to bring in good players. Ioane is just the kind of player that is worth that investment, and would be a piece of the championship puzzle for the Chargers."
  },
  {
    "name": "Sonny Styles",
    "team": "Buffalo Bills",
    "position": "LB",
    "college": "Ohio State",
    "body": "It takes a lot for a linebacker to put themselves in first round pick territory, but that's exactly what Sonny Styles has done at Ohio State. He's one of the most athletic players in the country, playing at the ideal size for a thumping run stopper while having the speed to cover anyone that he's matched up against. Assuming he does the measurable events at the combine, watching his performance is going to be prime-time television. During his four years as a Buckeye, he's played a number of different roles on defense, including as a safety and a slot corner, but his role at the NFL level is going to be as a true linebacker that can do everything associated with the position at a high level. The Bills linebackers have been a weak point of their defense, especially due Matt Milano's lengthy injury absences over the past three seasons. It's time for the team to finally draft his replacement, and Styles is the perfect candidate to take over the lead role of that defense."
  },
  {
    "name": "Dillon Thieneman",
    "team": "San Francisco 49ers",
    "position": "S",
    "college": "Oregon",
    "body": "The Niners have shown they're not scared to take the top player on their board, even if he's not close to that high on the consensus. Thieneman is the definition of speed and twitchiness from the safety position, and though it's rare a safety goes even this high in the draft, it's just as if not more rare to see a player with the combination of athleticism and coverage instinct that Thieneman has. With his skillset, he's ready to immediately start at free safety and emerge as a ball-hawk threat that the Niners just don't have. Turnovers are king, and having a deep safety with elite speed and the instincts to break on passes down the field is a huge asset in the modern game. Theineman won't ever be the most threatening safety against the run, but his speed is also an asset there and he's a solid tackler down the field. Drafting Thieneman would give the 49ers a true tool that adds another dimension to their defense, one that has the ability to flip the field in an instant and make the big plays that win games."
  },
  {
    "name": "Malik Muhammad",
    "team": "Seattle Seahawks",
    "position": "CB",
    "college": "Texas",
    "body": "There might not be a player in the draft right now that is more undervalued than Muhammad. His season so far has been the cherry on top of a fantastic three year career at Texas, where he's been one of the most lockdown corners in college football. Muhammad has the tools to develop into a top corner at the next level and the fundamentals and experience to step into the starting role on a playoff team with confidence. The Seahawks defense is already great, especially on the front end, but there's a clear opening at boundary corner that needs to be addressed moving into next season. Muhammad is a prime candidate to fill that role. He's been tested over and over again at the highest level of college football and consistently overcome every challenge that's come at him, making him extremely prepared to make the jump from college level to the pro level. Muhammad has the ability, and it'll shine for whichever team decides to make the decision to add him to their roster."
  },
  {
    "name": "A'Mauri Washington",
    "team": "Detroit Lions",
    "position": "DT",
    "college": "Oregon",
    "body": "For a team that prides itself on stopping the run, having an elite group of defensive tackles can take a lot of pressure off of the back end of the defense. The Lions are in a pretty good place up front, featuring a star in Alim McNeill and a young rookie in Tyliek Williams as future of the interior defensive line. Even so, Brad Holmes has shown that he's going to take the best player on their board and Washington has all the traits that will put him right at the top. He's an athletic freak rivaling the best at the defensive tackle position, with elite speed and twitch for his size and the power to complement it. Washington's viciousness in the run game is obvious, and with his explosiveness off the line of scrimmage, it's more a question of when and not if he'll become a threat as a pass rusher. Even so, defensive tackle is one of the hardest positions for a player to learn. It'll take time, but The Lions have shown they'll be willing to wait for that growth period in order to bring an elite player into the organization."
  },
  {
    "name": "Chris Brazzell II",
    "team": "Pittsburg Steelers",
    "position": "WR",
    "college": "Tennessee",
    "body": "It took a little while for the fourth wide receiver to come off of the board, but there's a lot of spots in front of this where Brazzell could go. He's a natural fit in pretty much any NFL offense, with a big frame, smooth movement, and a great feel for the football field. For the Steelers, quarterback is the big question mark for next season with Aaron Rodgers almost certainly moving into retirement, and one of the best ways to help a new quarterback succeed is by adding a wide receiver that knows how to get open. There's a lot of fantastic receivers in the NFL that succeed in a lot of different ways, but the kind that teams always seem to value the most are the ones that create open space, and that's exactly what Brazzell excels at. The Steelers haven't spent a first round pick on a wide receiver since they took Santonio Holmes at this exact same spot, twenty-fifth, in 2006. If it worked the first time, even if it was twenty years ago, it's worth doing it again, and Brazzell is the right kind of player to make the current squad remind fans of the Super Bowl XLIII team."
  },
  {
    "name": "Gennings Dunker",
    "team": "Denver Broncos",
    "position": "OG/OT",
    "college": "Iowa",
    "body": "Dunker is the newest in a line of Iowa prospects from the midwest that share the same modus operandi of tough, hard-nosed football. It hasn't exactly turned into massive success at the college level, but nobody can argue that Kirk Ferentz's team has been proficient in developing players into NFL talents. Dunker is a big, athletic lineman that has played right tackle for the Hawkeyes over the past three seasons, and certainly could play there at the professional level, but also has a good outlook as a mauling guard for the right team. In this case, that right team is the Broncos, who have shown that they're capable of developing lineman into elite players at their respective positions. The Broncos line is already fairly crowded, with Garrett Bowles, Quinn Meinerz, and Mike McGlinchey being foundational pieces for their offense, but Dunker is the clear best player available at this spot. The initial plan would likely be for him to play left guard until one of the tackle positions opens up, where he'd be a leading candidate in taking over there. Either way, he'd be a fantastic addition to a Broncos team that feels just a couple pieces away from being a true contender, and a great pick up for the future of the organization."
  },
  {
    "name": "Romello Height",
    "team": "Los Angeles Rams",
    "position": "EDGE",
    "college": "Texas Tech",
    "body": "The Rams have treated the draft as a gold mine for edge rushers over the past few years, drafting Byron Young, instant superstar Jared Verse, and so-far impressive Josaiah Stewart in back to back to back classes. Looking back, it's clear that the Rams saw something in these players that the rest of the NFL ignored, and Height could be the next in line of edge rushers with elite traits that fall to the Rams because of their \"limited\" profiles. For Height, much like Byron Young, it's the size and age that will likely cause teams to hesitate to select him. He's developed into one of the best pass rushers in the country over the past two years going from Georgia Tech to Texas Tech and utilizes his elite twitch and explosiveness at a high level to beat blocks. Height's got a small frame for an edge rusher, but that's helped him succeed in pass coverage when he's been asked to drop from the defensive line. For most teams, his size will likely be a knock against him, but the Rams have made it clear that they value players that can thrive both in rushing the passer and in pass coverage. Their defense is built like no other defense in the NFL, and that kind of defense is the perfect place for Height to dominate as their next grade A pick on the edge."
  },
  {
    "name": "Kenyon Sadiq",
    "team": "Philadelphia Eagles",
    "position": "TE",
    "college": "Oregon",
    "body": "There might not be a player in the draft with a more tantalizing profile than Sadiq. Look at the track record of elite tight ends at the NFL level, and every single one is an athletic freak. At this point, having a ridiculous athletic profile is basically a prerequisite to being a starting tight end. Going by those qualifications, Sadiq's got the job. He's going to light up the combine with his top end speed and explosiveness, and those traits are evident when he's on the field. Sadiq's smooth movement makes him look more like a wide receiver than a tight end running routes, and that kind of movement at his size will leave offensive coordinators dreaming pretty. That's not to say that he's not a good blocker, though his relatively small frame for an NFL tight end will likely keep whatever team drafts him from leaving him one on one with any elite edge rushers. Dallas Goedert is a free agent after the season, and the Eagles will inevitably be looking for a direct replacement in their offense moving into the future. Tight end is a hard position to learn, but Sadiq is ready to jump into a limited starting role year one. It's going to take a little bit of time for Sadiq to find his groove, but the Eagles haven't been scared to develop top end talent and will be willing to wait for Sadiq to grow into a top tight end in football."
  },
  {
    "name": "Denzel Boston",
    "team": "New England Patriots",
    "position": "WR",
    "college": "Washington",
    "body": "A player with the last name Boston heading to play in New England? It's only fitting. The Patriots offense has done a good job of moving the ball without a true number one receiver, but creating sustainable offensive success requires offensive threats. They have to find a way to maximize success during Drake Maye's rookie contract, and the way to do that is by continuing to find the building blocks for the future of their offense. Boston is a smooth mover with good hands who knows how to use his physicality to make catches. He fits the role of a skeleton key in the offense, being comfortable in any position, any role, and on any route. Put him in the slot, or let him play the X, and he'll thrive. He's a threat on a screen play, running a slant, or getting a step on defenders while extending the field. His effort against the run is the epitome of “No block, no rock”. Everything he does screams fundamental, and for a team led by Mike Vrabel that's exactly the mentality it's going to take to thrive. The Patriots are going to need some extra offensive firepower to keep the offense rolling and let Drake Maye loose, and Boston has all the traits to be that guy."
  },
  {
    "name": "Keldric Faulk",
    "team": "Dallas Cowboys",
    "position": "EDGE",
    "college": "Auburn",
    "body": "The Cowboys have made it known that they're looking to spend assets in order to get high impact defensive lineman. Maybe, just maybe, they should have just paid Micah Parsons what he deserved rather than moving him for picks, but at the very least they have to maximize the return from that trade. Drafting Micah was like catching lightning in a bottle, but that doesn't mean the trade can't be a bad one in the long term. This is the first pick that they got back from the Packers, and what better way to start the return than by adding a presence on the defensive line. Faulk is a big defensive end that plays less like lightning and more like thunder, with explosiveness and power on the defensive line that rivals the best at the position. Faulk's size and physicality will make him an instant impact in the run game, and his overall athleticism and violence will let him grow into a good pass rusher as he adapts to the NFL game. He's just the kind of player that the Cowboys love on both sides of their line: physical, violent, and powerful. There's no player that could instantly make up for what the Cowboys lost in trading Micah, but Faulk would be a good step forward in making that trade a good thing for the organization as a whole."
  },
  {
    "name": "Cashius Howell",
    "team": "Tampa Bay Buccaneers",
    "position": "EDGE",
    "college": "Texas A&M",
    "body": "For any team looking for a pass rush specialist in the middle to late first round, Cashius Howell is going to be their guy. His resume is obvious just by looking at his numbers, as he's tallied twenty-four sacks on 112 total pressures going back to 2023, including ten sacks so far this season. There's value in a player that knows how to learn and Howell has shown that skill clearly, having made strides year after year during his five year college career. For an edge rusher, his elite bend and length off the edge makes him a prime candidate to be one of the first defensive lineman selected in this year's class. Plainly, Howell has the tools to thrive as a pass rusher at the next level. It's going to take time for him to settle in as a run defender and in coverage, but he's got the skillset to do both at a solid level as he adapts to the NFL game. Looking at teams where Howell fits best, it's no doubt that the Buccaneers are near, if not at, the top of the list. They love to deploy speed and bend on the edge, and Howell fits that mold to a tee. Getting an edge rusher in Howell that can immediately help a competing team and eventually work his way into a star on the edge would be a fantastic haul for the Buccaneers this late in the first round."
  },
  {
    "name": "Avieon Terrell",
    "team": "Indianapolis Colts",
    "position": "CB",
    "college": "Clemson",
    "body": "Terrell is another prospect that's been projected as a first round pick all year. This feels like a slightly boring way to end off the mock draft, but this selection was another match made in heaven. There's been so much good play associated with the Colts thus far into the year, but if there is a noticeable flaw in their team currently it's the pass coverage. Opposing offenses have found it much easier to pass on the Colts defense than run against them, and improving that balance starts with adding depth to the cornerback room. What better way to do that than with Terrell, the younger brother of Falcons corner A.J. Terrell. The younger Terrell will be a weapon at corner for whoever drafts him. He's absolutely capable of playing outside corner, but his skills translate just as strongly to the slot if that's the most impactful role for him to play in any given defense. Critics will point to his small size for a boundary corner, but he plays with a level of physicality that neutralizes those concerns. That same physicality comes across in the run game as well, where he sets the tone for other defensive backs to play just as physically. For the Colts, it's the kind of play that fits right into their culture defensively, along with the kind of player that can make an impact for a contender right away."
  }
]